INSERT INTO students (name, furigana, nickname, mail, area, age, gender, remark, is_deleted)
VALUES ('山田太郎', 'やまだたろう', 'たろう', 'taro@example.com', '東京都', 30, '男性', '', false),
       ('田中花子', 'たなかはなこ', 'はな', 'hanako@example.com', '大阪府', 25, '女性', '', true),
       ('山田太郎', 'やまだたろう', 'やまだ', 'yama@example.com', '愛知県', 43, 'その他', '', true),
       ('山田次郎', 'やまだじろう', 'じろう', 'jiro@example.com', '東京都', 25, '男性', '', false),
       ('亀田花子', 'かめだはなこ', 'かめ', 'kame@example.com', '石川県', 18, '女性', '', false);

INSERT INTO students_courses (student_id, course_name, start_at, end_at)
VALUES (1, 'AWS', '2024-04-01T09:00:00', '2024-06-01T09:00:00'),
       (2, 'JAVA', '2024-08-01T09:00:00', '2024-10-01T09:00:00'),
       (1, 'JAVA', '2024-08-01T09:00:00', '2024-10-01T09:00:00'),
       (3, 'デザイン', '2024-09-01T09:00:00', '2024-11-01T09:00:00'),
       (4, 'AWS', '2024-11-01T09:00:00', '2025-01-01T09:00:00'),
       (1, 'デザイン', '2024-11-01T09:00:00', '2025-01-01T09:00:00'),
       (5, 'JAVA', '2024-12-01T09:00:00', '2025-02-01T09:00:00'),
       (3, 'AWS', '2025-01-01T09:00:00', '2025-03-01T09:00:00');
